# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80  # number of classes
nclr: 5
depth_multiple: 0.3  # model depth multiple
width_multiple: 0.2  # layer channel multiple

anchors:
  - [8,8]  # P3/8
  - [16,16]  # P4/16
  - [32,32]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv,   [64, 6, 2, 2]],  # 0
   [-1, 1, Conv,   [128, 3, 2]],    # 1
   [-1, 3, C3  ,   [128,True]],     # 2

   [-1, 1, Conv, [256, 3, 2]],      # 3
   [-1, 6, C3,    [256,True]],      # 4

   [-1, 1, Conv, [512, 3, 2]],      # 5
   [-1, 9, C3,    [512,True]],      # 6

   [-1, 1, Conv, [1024, 3, 2]],      # 7
   [-1, 3, C3,    [1024,True]],      # 8
  ]

# YOLOv5 v6.0 head
head:
  [ 
   [4, 1, CBLinear, [[256]]],           # 9
   [6, 1, CBLinear, [[256, 512]]],      # 10
   [8, 1, CBLinear, [[256, 512, 512]]], # 11

   [2, 1, Conv, [256, 3, 2]],    # 12
   [[9, 10, 11, -1], 1, CBFuse, [[0, 0, 0]]], # 13  
   [-1, 3, C3, [256, True]],  # 14 

   [-1, 1, Conv, [512, 3, 2]],   # 15
   [[10, 11, -1], 1, CBFuse, [[1, 1]]],  # 16
   [-1, 3, C3, [512, True]],  # 17 


   [-1, 1, Conv, [512, 3, 2]],   # 18
   [[11, -1], 1, CBFuse, [[2]]], # 19
   [-1, 3, C3, [1024, True]],   # 20

   [[14, 17, 20], 1, Detect, [nc,nclr,anchors]],  # Detect(P3, P4, P5)
  ]
